Revit 2024 API
MEPBuildingConstructionSet.ReverseIterator Method
Retrieve a backward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual MEPBuildingConstructionSetIterator ReverseIterator()
Visual Basic
Public Overridable Function ReverseIterator As MEPBuildingConstructionSetIterator
Visual C++
public:
virtual MEPBuildingConstructionSetIterator^ ReverseIterator()
Return Value
Returns a backward moving iterator to the set.
See Also
MEPBuildingConstructionSet Class
Autodesk.Revit.DB.Mechanical Namespace